cf/Catalogs/НастройкиБлокировкиРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НастройкиБлокировкиРеквизитов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлокировкаОсновная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлокировкаПриПолнойСинхронизации</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/НастройкиБлокировкиРеквизитов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоля(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		Сообщить("Сначала заполните объект метаданных");
		Возврат;
	КонецЕсли;
	
	СвойстваОбъекта = Новый Структура;
	СвойстваОбъекта.Вставить("СтандартныеРеквизиты", "Стандартный реквизит");
	СвойстваОбъекта.Вставить("Реквизиты", "Реквизит");
	СвойстваОбъекта.Вставить("ТабличныеЧасти", "Табличная часть");
	Для каждого СвойствоОбъекта Из СвойстваОбъекта Цикл
		ЗаполнитьСтрокиНаСервере(СвойствоОбъекта);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиНаСервере(СвойствоОбъекта)

	Для каждого Реквизит Из Метаданные.Справочники[Объект.Код][СвойствоОбъекта.Ключ] Цикл
		СтрокаРеквизит = Объект.Реквизиты.Добавить();
		СтрокаРеквизит.ВидПоля = СвойствоОбъекта.Значение;
		СтрокаРеквизит.Поле = Реквизит.Имя;
		СтрокаРеквизит.ПолеПредставление = Реквизит.Синоним;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСтрокиНаСервере()
